//测试各类运算符缺左右操作数以及函数缺括号的情况
int main() {
    //= y + z;   // 缺左操作数
    x = ;        // 缺右操作数
    //&& b;      // 缺左操作数
    a && ;       // 缺右操作数
    //|| c;      // 缺左操作数
    a || ;       // 缺右操作数
    //< 0;       // 缺左操作数
    x > ;        // 缺右操作数
    //+ y;       // 缺左操作数
    x + ;        // 缺右操作数
    //- z;       // （二元减号）缺左操作数
    x - ;        // 缺右操作数
    //* z;       // 缺左操作数
    x * ;        // 缺右操作数
    /// z;       // 缺左操作数
    x / ;        // 缺右操作数
    x = (a + b;  // 漏右括号
    //x = a + b);// 多右括号
    -;          // 一元减号后缺操作数
    !;          // 逻辑非后缺操作数
    p.;         // 成员名缺失
    //.f;       // 对象缺失
    baz( ;      // 无参调用缺右括号
    baz(1;      // 有参调用缺右括号
    return 0;
}
